# 1st program
print (9 ** 0.5 * 5)                    # выводим в консоль результат вычисления

# 2nd program
print (9.99 > 9.98 and 1000 != 1001)    # выводим в консоль результат сравнения

# 3rd program
print (2 + 2 * 2)                       # выводим в консоль первое значение
print ((2 + 2) * 2)                     # выводим в консоль второе значение
print ((2 + 2 * 2) == (2 + 2) * 2)      # выводим сравнение

# 4rd program
print(int(float('123.456') * 10) % 10)  # переводим целое число в дробное, сдвигаем умножением на 10 запятую вправо, производим остаточное деление на 10